# DecalAttributes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DecalAttributes Property
ParameterTypeId Class See Also
---
"Decal Attributes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DecalAttributes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DecalAttributes As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DecalAttributes {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace